tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/constant/gas/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            heatSource;

    selectionMode   cellSet;
    cellSet         ignitionCells;

    q
    {
        type        scale;
        scale       squarePulse;
        start       0.001;
        duration    1e-04;
        value       1e+10;
    }
}

// ************************************************************************* //
