tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/constant/gas/mixtureFractionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mixtureFractionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

oxidizerMassFractions
{
    N2       0.767;
    O2	     0.233;

}

fuelMassFractions
{
    H2 1.0;
}


#include "$FOAM_CASE/constant/gas/mech/thermo/thermo.foam"


// ************************************************************************* //
