tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/constant/gas/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         coefficientWilkeMultiComponentMixture;
    transport       polynomial;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;

#include "$FOAM_CASE/constant/gas/mech/thermo/species.foam";
#include "$FOAM_CASE/constant/gas/mech/thermo/thermo.foam";


// ************************************************************************* //
