tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.62;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           4.0;

libs (
    "libchemistryModel_DLB.so"
    "libODE_DLB.so"
    "$FOAM_CASE/constant/gas/mech/lib/libc_pyjac.so"
    "libFickianTransport.so"
);

DebugSwitches
{
    compressible::turbulentTemperatureCoupledBaffleMixed 3;
    externalWallHeatFluxTemperature 3;
}

functions {
    #includeFunc sampleFn
}

// ************************************************************************* //
