tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    note            "mesh decomposition control dictionary";
    object          decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;

method          manual;

manualCoeffs
{
    dataFile        "manualDecomposition";
}

simpleCoeffs
{
    n               ( 6 1 1 );
}


// ************************************************************************* //
