tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/system/gas/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
    // backward is not needed if transient is not important
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss limitedLinearV 1;
    div(phi,K)          Gauss linear;
    div(phi,Yi)         Gauss limitedLinear01   1;
    div(phi,h)          Gauss limitedLinear     1;
    div(phi,Yi_h)       Gauss limitedLinear01   1;
    // div(phi,Yi_h)   Gauss multivariateSelection // doesn't work with CHT in OF 10
    // {
    //     H2          limitedLinear01 1;
    //     H           limitedLinear01 1;
    //     O2          limitedLinear01 1;
    //     O           limitedLinear01 1;
    //     H2O         limitedLinear01 1;
    //     OH          limitedLinear01 1;
    //     H2O2        limitedLinear01 1;
    //     HO2         limitedLinear01 1;
    //     NO          limitedLinear01 1;
    //     N2O         limitedLinear01 1;
    //     N           limitedLinear01 1;
    //     NH          limitedLinear01 1;
    //     NNH         limitedLinear01 1;
    //     NH2         limitedLinear01 1;
    //     N2          limitedLinear01 1;
    //     h           limitedLinear 1;
    // };
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
    div(heatFluxCorr)   Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
