tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/system/gas/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
    }

    rhoFinal
    {
        $rho;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-07;
        relTol          0.01;
        minIter         1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    ph_rgh
    {
        $p_rgh;
    }

    "(U|Yi|h|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        relTol          0.01;
        tolerance       1e-08;
        minIter         1;
    }

    "(U|Yi|h|e)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    1; // doesn't have any effect, change one in constant folder
    nCorrectors         2;
    nNonOrthogonalCorrectors 2;

    models              true;  // default: true
    thermophysics       true;  // default: true
    flow                true;  // default: true
    momentumPredictor   true;  // default: true
    transonic           false; // default: false
    consistent          false; // default: false

    pRefCell        0;
    pRefValue       101000;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}

// ************************************************************************* //
