tutorials/DLBFoam-Hydrogen-Tutorials/2D_jet_flame/system/nozzle/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    location    "system/nozzle";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    e
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           0.1;
        minIter          1;
        // maxIter          10;
    }

    eFinal
    {
        $e;
        relTol           0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        e         1;
    }
}

// ************************************************************************* //
